<?php
if(tgdzwh($tg[$dtg])=="金" and $wnum2>=1){
	$szyc="·命局有财，主一生丰衣足食";
}
if(tgdzwh($tg[$dtg])=="金" and $wnum2==0){
	$szwc="·命局财弱，主一生过手的钱不少，花费也多";
}
if(tgdzwh($tg[$dtg])=="木" and $wnum5>=1){
	$szyc="·命局有财，主一生丰衣足食";
}
if(tgdzwh($tg[$dtg])=="木" and $wnum5==0){
	$szyc="·命局财弱，主一生过手的钱不少，花费也多";
}
if(tgdzwh($tg[$dtg])=="水" and $wnum4>=1){
	$szyc="·命局有财，主一生丰衣足食";
}
if(tgdzwh($tg[$dtg])=="水" and $wnum4==0){
	$szyc="·命局财弱，主一生过手的钱不少，花费也多";
}
if(tgdzwh($tg[$dtg])=="火" and $wnum1>=1){
  $szyc="·命局有财，主一生丰衣足食";
}
if(tgdzwh($tg[$dtg])=="火" and $wnum1==0){
  $szyc="·命局财弱，主一生过手的钱不少，花费也多";
}
if(tgdzwh($tg[$dtg])=="土" and $wnum5>=1){
	$szyc="·命局有财，主一生丰衣足食";
}
if(tgdzwh($tg[$dtg])=="土" and $wnum5==0){
	$szyc="·命局财弱，主一生过手的钱不少，花费也多";
}

if(tgdzwh($tg[$dtg])=="金" and (tgdzwh($tg[$ty])=="木" or tgdzwh($tg[$tm])=="木" or tgdzwh($tg[$ttg])=="木")){
  $ctc="<br>·财透出，为人慷慨大方";
}
if(tgdzwh($tg[$dtg])=="金" and $wnum2>=1){
  $cyc="<br>·财星暗藏，主一生财源滚滚，有厚财可得";
}
if(tgdzwh($tg[$dtg])=="木" and (tgdzwh($tg[$ty])=="土" or tgdzwh($tg[$tm])=="土" or tgdzwh($tg[$ttg])=="土")){
  $ctc="<br>·财透出，为人慷慨大方";
}
if(tgdzwh($tg[$dtg])=="木" and $wnum5>=1){
  $cyc="<br>·财星暗藏，主一生财源滚滚，有厚财可得";
} 
if(tgdzwh($tg[$dtg])=="水" and (tgdzwh($tg[$ty])=="火" or tgdzwh($tg[$tm])=="火" or tgdzwh($tg[$ttg])=="火")){
  $ctc="<br>·财透出，为人慷慨大方";
}
if(tgdzwh($tg[$dtg])=="水" and $wnum4>=1){
  $cyc="<br>·财星暗藏，主一生财源滚滚，有厚财可得";
} 
if(tgdzwh($tg[$dtg])=="火" and (tgdzwh($tg[$ty])=="金" or tgdzwh($tg[$tm])=="金" or tgdzwh($tg[$ttg])=="金")){
	$ctc="<br>·财透出，为人慷慨大方";
}
if(tgdzwh($tg[$dtg])=="火" and $wnum1>=1){
	$cyc="<br>·财星暗藏，主一生财源滚滚，有厚财可得";
} 
if(tgdzwh($tg[$dtg])=="土" and (tgdzwh($tg[$ty])=="水" or tgdzwh($tg[$tm])=="水" or tgdzwh($tg[$ttg])=="水")){
	$ctc="<br>·财透出，为人慷慨大方";
}
if(tgdzwh($tg[$dtg])=="土" and $wnum3>=1){
	$cyc="<br>·财星暗藏，主一生财源滚滚，有厚财可得";
}          

if(tgdzwh($tg[$dtg])=="金" and $zh>1 and $wnum2>=2){
  $swcw="<br>·身旺财旺为福，带官星更妙<br>·身旺合财地，财基必大。<br>·身强财旺，利名声，先财后印反为福";
  $rwcw="<br>·日旺财旺，天下富翁，带正官，富贵双全，男命得妻贤多助";
  $dqq="<br>·日干旺，正财偏财亦旺，富裕，异性缘好<br>·财旺身强，主妻貌多能，有内助之功，而且容易因妻得富得贵。<br>·女命财薄为吉，财多主桃花旺<br>·财为用神妻必贤美，得内助。<br>·正财生正官，且财官为喜用，必得助夫之妇，因妻得贵。";
  $cdkb2="<br>·财星太重，为人孤刻。";
} 
if(tgdzwh($tg[$dtg])=="金" and $zh<1 and $wnum2>=2){
  $cdsr="财多身弱，一生过手的钱不少，花费也多";
  $cdsrn="<br>·男遇财多身弱，偏听妻言。<br>·财多身弱，离祖求婚。";
  $cdkb="<br>·财星太重，为人孤刻。";
} 
if(tgdzwh($tg[$dtg])=="木" and $zh>1 and $wnum5>=2){
  $swcw="<br>·身旺财旺为福，带官星更妙<br>·身旺合财地，财基必大。<br>·身强财旺，利名声，先财后印反为福";
  $rwcw="<br>·日旺财旺，天下富翁，带正官，富贵双全，男命得妻贤多助";
  $dqq="<br>·日干旺，正财偏财亦旺，富裕，异性缘好<br>·财旺身强，主妻貌多能，有内助之功，而且容易因妻得富得贵。<br>·女命财要薄，财多主淫乱<br>·财为用神妻必贤美，得内助。<br>·正财生正官，且财官为喜用，必得助夫之妇，因妻得贵。";
  $cdkb2="<br>·财星太重，为人孤刻。";
} 
if(tgdzwh($tg[$dtg])=="木" and $zh<1 and $wnum3>=2){
  $cdsr="<br>·财多身弱，一生过手的钱不少，花费也多";
  $cdsrn="<br>·男遇财多身弱，偏听妻言。<br>·财多身弱，离祖求婚。";
  $cdkb="<br>·财星太重，为人孤刻。";
} 
if(tgdzwh($tg[$dtg])=="水" and $zh>1 and $wnum4>=2){
  $swcw="<br>·身旺财旺为福，带官星更妙<br>·身旺合财地，财基必大。<br>·身强财旺，利名声，先财后印反为福";
  $rwcw="<br>·日旺财旺，天下富翁，带正官，富贵双全，男命得妻贤多助";
  $dqq="<br>·日干旺，正财偏财亦旺，富裕，异性缘好<br>·财旺身强，主妻貌多能，有内助之功，而且容易因妻得富得贵。<br>·女命财要薄，财多主淫乱<br>·财为用神妻必贤美，得内助。<br>·正财生正官，且财官为喜用，必得助夫之妇，因妻得贵。";
  $cdkb2="<br>·财星太重，为人孤刻。";
} 
if(tgdzwh($tg[$dtg])=="水" and $zh<1 and $wnum4>=2){
  $cdsr="<br>·财多身弱，一生过手的钱不少，花费也多";
  $cdsrn="<br>·男遇财多身弱，偏听妻言。<br>·财多身弱，离祖求婚。";
  $cdkb="<br>·财星太重，为人孤刻。";
} 
if(tgdzwh($tg[$dtg])=="火" and $zh>1 and $wnum1>=2){
	$swcw="<br>·身旺财旺为福，带官星更妙<br>·身旺合财地，财基必大。<br>·身强财旺，利名声，先财后印反为福";
	$rwcw="<br>·日旺财旺，天下富翁，带正官，富贵双全，男命得妻贤多助";
	$dqq="<br>·日干旺，正财偏财亦旺，富裕，异性缘好<br>·财旺身强，主妻貌多能，有内助之功，而且容易因妻得富得贵。<br>·女命财要薄，财多主淫乱<br>·财为用神妻必贤美，得内助。<br>·正财生正官，且财官为喜用，必得助夫之妇，因妻得贵。";
	$cdkb2="<br>·财星太重，为人孤刻。";
} 
if(tgdzwh($tg[$dtg])=="火" and $zh<1 and $wnum1>=2){
  $cdsr="<br>·财多身弱，一生过手的钱不少，花费也多";
  $cdsrn="男遇财多身弱，偏听妻言。<br>·财多身弱，离祖求婚。";
  $cdkb="<br>·财星太重，为人孤刻。";
} 
if(tgdzwh($tg[$dtg])=="土" and $zh>1 and $wnum3>=2){
  $swcw="<br>·身旺财旺为福，带官星更妙<br>·身旺合财地，财基必大。<br>·身强财旺，利名声，先财后印反为福";
  $rwcw="<br>·日旺财旺，天下富翁，带正官，富贵双全，男命得妻贤多助";
  $dqq="<br>·日干旺，正财偏财亦旺，富裕，异性缘好<br>·财旺身强，主妻貌多能，有内助之功，而且容易因妻得富得贵。<br>·女命财要薄，财多主淫乱<br>·财为用神妻必贤美，得内助。<br>·正财生正官，且财官为喜用，必得助夫之妇，因妻得贵。";
  $cdkb2="<br>·财星太重，为人孤刻。";
} 
if(tgdzwh($tg[$dtg])=="土" and $zh<1 and $wnum3>=2){
	$cdsr="<br>·财多身弱，一生过手的钱不少，花费也多";
  $cdsrn="<br>·男遇财多身弱，偏听妻言。<br>·财多身弱，离祖求婚。";
  $cdkb="<br>·财星太重，为人孤刻。";
} 

if(tgdzwh($tg[$dtg])=="金" and $zh>1 and $wnum2>=2 and $wnum5>1){
	$scyw="<br>·财旺，身旺，又有印生，有名有利<br>·财多有印护身，妻贤儿秀，晚年福丰";
} 
if(tgdzwh($tg[$dtg])=="木" and $zh>1 and $wnum5>=2 and $wnum3>1){
	$scyw="<br>·财旺，身旺，又有印生，有名有利<br>·财多有印护身，妻贤儿秀，晚年福丰";
} 
if(tgdzwh($tg[$dtg])=="水" and $zh>1 and $wnum4>=2 and $wnum1>1){
	$scyw="<br>·财旺，身旺，又有印生，有名有利<br>·财多有印护身，妻贤儿秀，晚年福丰";
} 
if(tgdzwh($tg[$dtg])=="火" and $zh>1 and $wnum1>=2 and $wnum2>1){
	$scyw="<br>·财旺，身旺，又有印生，有名有利<br>·财多有印护身，妻贤儿秀，晚年福丰";
} 
if(tgdzwh($tg[$dtg])=="土" and $zh>1 and $wnum3>=2 and $wnum4>1){
  $scyw="<br>·财旺，身旺，又有印生，有名有利<br>·财多有印护身，妻贤儿秀，晚年福丰";
} 

if(tgdzwh($tg[$dtg])=="金" and $wnum2>=1 and $wnum3>=1){
	$cqtmh="<br>·财气通门户，旺益双亲，可富显";
}
if(tgdzwh($tg[$dtg])=="木" and $wnum5>=1 and $wnum4>=1){
	$cqtmh="<br>·财气通门户，旺益双亲，可富显";
}
if(tgdzwh($tg[$dtg])=="水" and $wnum4>=1 and $wnum2>=1){
	$cqtmh="<br>·财气通门户，旺益双亲，可富显";
}
if(tgdzwh($tg[$dtg])=="火" and $wnum1>=1 and $wnum5>=1){
	$cqtmh="<br>·财气通门户，旺益双亲，可富显";
}
if(tgdzwh($tg[$dtg])=="土" and $wnum3>=1 and $wnum1>=1){
	$cqtmh="<br>·财气通门户，旺益双亲，可富显";
}
if(tgdzwh($tg[$dtg])=="金" and $zh>1 and(tgdzwh($tg[$ty])=="木" or tgdzwh($tg[$tm])=="木" or tgdzwh($tg[$ttg])=="木") and (tgdzwh($tg[$ty])=="火" or tgdzwh($tg[$tm])=="火" or tgdzwh($tg[$ttg])=="火")){
	$cgsm="<br>·财官双美，透露极荣";
}
if(tgdzwh($tg[$dtg])=="金"  and((($dz[$dy]=="辰" or $dz[$dm]=="辰" or $dz[$ddz]=="辰" or $dz[$tdz]=="辰") or ($dz[$dy]=="戌" or $dz[$dm]=="戌" or $dz[$ddz]=="戌" or $dz[$tdz]=="戌")) or(($dz[$dy]=="丑" or $dz[$dm]=="丑" or $dz[$ddz]=="丑" or $dz[$tdz]=="丑") or ($dz[$dy]=="未" or $dz[$dm]=="未" or $dz[$ddz]=="未" or $dz[$tdz]=="未")))){
	$ystg="<br>·印绶通根，逢财(木)则发。";
}
if(tgdzwh($tg[$dtg])=="木" and $zh>1 and(tgdzwh($tg[$ty])=="土" or tgdzwh($tg[$tm])=="土" or tgdzwh($tg[$ttg])=="土") and (tgdzwh($tg[$ty])=="金" or tgdzwh($tg[$tm])=="金" or tgdzwh($tg[$ttg])=="金")){
	$cgsm="<br>·财官双美，透露极荣";
}
if(tgdzwh($tg[$dtg])=="木"  and(($dz[$dy]=="亥" or $dz[$dm]=="亥" or $dz[$ddz]=="亥" or $dz[$tdz]=="亥") or ($dz[$dy]=="亥" or $dz[$dm]=="亥" or $dz[$ddz]=="亥" or $dz[$tdz]=="亥"))){
	$ystg="<br>·印绶通根，逢财(土)则发。";
}
if(tgdzwh($tg[$dtg])=="水" and $zh>1 and(tgdzwh($tg[$ty])=="火" or tgdzwh($tg[$tm])=="火" or tgdzwh($tg[$ttg])=="火")  and (tgdzwh($tg[$ty])=="土" or tgdzwh($tg[$tm])=="土" or tgdzwh($tg[$ttg])=="土")){
	$cgsm="<br>·财官双美，透露极荣";
}
if(tgdzwh($tg[$dtg])=="水"  and(($dz[$dy]=="申" or $dz[$dm]=="申" or $dz[$ddz]=="申" or $dz[$tdz]=="申") or ($dz[$dy]=="酉" or $dz[$dm]=="酉" or $dz[$ddz]=="酉" or $dz[$tdz]=="酉"))){
	$ystg="<br>·印绶通根，逢财(火)则发。";
} 
if(tgdzwh($tg[$dtg])=="火" and $zh>1 and(tgdzwh($tg[$ty])=="金" or tgdzwh($tg[$tm])=="金" or tgdzwh($tg[$ttg])=="金")  and (tgdzwh($tg[$ty])=="水" or tgdzwh($tg[$tm])=="水" or tgdzwh($tg[$ttg])=="水")){
	$cgsm="<br>·财官双美，透露极荣";
}
if(tgdzwh($tg[$dtg])=="火"   and(($dz[$dy]=="寅" or $dz[$dm]=="寅" or $dz[$ddz]=="寅" or $dz[$tdz]=="寅") or ($dz[$dy]=="卯" or $dz[$dm]=="卯" or $dz[$ddz]=="卯" or $dz[$tdz]=="卯"))){
	$ystg="<br>·印绶通根，逢财(金)则发。";
}
if(tgdzwh($tg[$dtg])=="土" and $zh>1 and(tgdzwh($tg[$ty])=="水" or tgdzwh($tg[$tm])=="水" or tgdzwh($tg[$ttg])=="水") and (tgdzwh($tg[$ty])=="木" or tgdzwh($tg[$tm])=="木" or tgdzwh($tg[$ttg])=="木")){
	$cgsm="<br>·财官双美，透露极荣";
}
if(tgdzwh($tg[$dtg])=="土"  and(($dz[$dy]=="巳" or $dz[$dm]=="巳" or $dz[$ddz]=="巳" or $dz[$tdz]=="巳") or ($dz[$dy]=="午" or $dz[$dm]=="午" or $dz[$ddz]=="午" or $dz[$tdz]=="午"))){
	$ystg="<br>·印绶通根，逢财(水)则发。";
}

if($dgz="丙午" or $dgz="丙子" or $dgz="丁未" or $dgz="丁丑" or $dgz="戊申" or $dgz="戊寅" or $dgz="辛酉" or $dgz="辛卯" or $dgz="壬戌" or $dgz="壬辰" or $dgz="癸巳" or $dgz="癸亥"){
	$ycyc="<br>·阴差阳错日者《三命通会》云“女子逢之，公姑寡合，妯娌不足，夫家冷退；男子逢之，主退外家，亦与妻家是非寡合。其煞，不论男女...主不得外家力，纵有妻财，亦成虚花，久后仍与外家为仇，不相往来”。";
	$ycycwj="<br>·阴阳差错，外交冷落。";
}

if((tgdzwh($tg[$dtg])=="金" and $wnum5>=2 and $wnum4<=1) or (tgdzwh($tg[$dtg])=="木" and $wnum3>=2 and $wnum1<=1) or (tgdzwh($tg[$dtg])=="水" and $wnum1>=2 and $wnum5<=1) or (tgdzwh($tg[$dtg])=="火" and $wnum2>=2 and $wnum3<=1) or  (tgdzwh($tg[$dtg])=="土" and $wnum4>=2 and $wnum2<=1)){ 
  $ywgq="<br>·印旺官轻，坐堂招夫(女命)";
}
if($wnum1>=2){
	$jw="<br>·金多威武刚烈。果断好强" ;
}
if($wnum2>=2){
	$mw="<br>·木盛有恻隐博爱之心，乐善好施" ;
}
if($wnum3>=2){
	$sw="<br>·水多聪明，技巧,智慧过人。<br>·水多主淫，到老不休" ;
}
if($wnum4>=2){
	$hw="<br>·火多性急玲珑，雄辩滔滔<br>·火主礼，讲究礼节" ;
}
if($wnum5>=2){
  $tw="<br>·土多主信，一诺千金" ;
}
if($sex==0 and $zh<1){
  $nmsr="<br>·女命身弱，主性纯粹而温柔，奉翁助夫";
}
if($sex==0 and $zh>15){
  $nmsq="<br>·女命身强欺夫，不孝公婆，是非多，性急。"	;
}

if($wnum1>=2 and $wnum3>=2){
	$jqsb="<br>·金白水清，聪明显达" ;
}
if(zh>1 and $zh<15){
$zhpw="<br>·食神为喜用，为人聪明温厚恭良，流露出精英秀气，秉性温和不善与人争执，有长者风度，有文人学士的气质，乐天知命，重视精神与物质的协调，具有感性，对文学，艺术，宗教等有爱好的趋势<br>·伤官为喜用，其人大多长相秀丽可爱，且多才多艺，口才极佳，聪明能干，敢做敢为，内心充满着活力与奋斗精神，故很容易在某一方面获得成功，荣誉与权威。<br>·正财为喜用，主其人聪明诚实，行事节约不浪费，安守本分，做事一向小心谨慎，不做非份之想，珍惜金钱，重视生活保障，作事守信用。<br>·偏财为喜用，其人本性慷慨而有感情，口齿伶俐，有交际才华，有魄力，好活动，为人豪爽明朗，决断力强，富狭义性与风流心，对物质眼光敏锐，有经济手腕，个性明朗，外缘好，才能高，敏捷奇巧。";
}

if($zh>=15){
$taiw="<br>·正印为忌神，缺乏独立自主的精神，有依赖心，有稍微的利己主义，易倾于吝啬，思想有点天真，常把事情想得过分美好，以致常常不能如其所愿，自尊心强，好面子。<br>·劫财为忌神，神气高傲，鲁莽，性格执拗不认输，个性矛盾，具双重性格，对感情处理上，有苛对自己人，宽以待别人的现象，而导致家庭失和，应特别注意。<br>·比肩为忌神，大多乖僻寡和，独断独行，行事多以自我为中心，坚持己见，不容易妥协，所以有时很难与人和睦相处，很少有知心朋友，对待部属和亲人也比较严厉刻薄，不通人情，喜自我封闭。<br>·偏印为忌神，做事精明干炼但缺乏持久的耐力，做事三心二意，喜走捷径，喜欢多学但很少精通。度量小，利己，常常过高评价自己，与他人相处，也格格不入。如能反省这些缺点，就会发挥上天所赋于的特殊奔放的才能，有可能在人生旅途中成大功，立大业。<br>·正官为喜用，聪明有见识，行事知分寸而带有贵气，细心致密，朴素勤俭。<br>·偏官为喜用，有狭义心，争斗性旺盛，决断力强，喜欢冒险，有志气，富进取心，言出必行，不善虚伪客套，勇于突破恶劣环境，当世界愈纷乱的时候，偏官的真正价值也就能真正发挥出来。偏官为忌神，喜欢酒色而好斗，而且个性急躁，容易和他人发生冲突，做事过度激进，使人难于容忍与谅解而树敌，所以知心朋友不多。<br>·食神为喜用，为人聪明温厚恭良，流露出精英秀气，秉性温和不善与人争执，有长者风度，有文人学士的气质，乐天知命，重视精神与物质的协调，具有感性，对文学，艺术，宗教等有爱好的趋势<br>·伤官为喜用，其人大多长相秀丽可爱，且多才多艺，口才极佳，聪明能干，敢做敢为，内心充满着活力与奋斗精神，故很容易在某一方面获得成功，荣誉与权威。";
}

if($zh<1 and $zh>-10){
  $zhpr="<br>·食神为忌神，没有刻苦耐劳的气魄，依赖心强，喜欢言过其实，有时理想与现实脱节，说得多而做得少，容易疲劳而倦怠，自我清高，顾影自怜。<br>·伤官为忌神，常会对自己作过高的评价，而有蔑视他人的趋势，任性而为，一意孤行，不愿受世俗礼法的拘束，而且兴趣太杂，博而不精，并且其人多放荡不羁，多傲气，很容易被人认为是一个狂傲乖张的人，且喜欢好管闲事而弄巧成拙。<br>·正财为忌神，有吝啬的趋势，魄力不足，生活略嫌刻板乏味，喜斤斤计较，太坚守原则，死板，凡事不懂得变通，因而引起无端的烦恼，令人觉得憨直老实。<br>·偏财为忌神，苟安耽乐，有爱受人奉承，拍马屁的倾向，且好说是非，常常言过其实，嗜酒贪花，多诈且处世虚伪。<br>·正印为喜用，其人宅心仁厚，精神潇洒，心性善良，富人情味，知性敏锐，处世圆融，重视人格的内涵与高尚气质的培养，且对宗教与道德规范有敬仰与谨守的勇气。<br>·偏印为喜用，具有独创性的优秀才能，有奇特的领悟力与感受力，警觉性高，擅长偏业，旁谋，并有心得，并善于察言观色，心思细腻，精明干炼。";
}
if($zh<=-10){
  $tair="<br>·正官为忌神，有骄傲刚愎的现象但临事又优柔寡断，或缺乏责任感，目无法纪。<br>·偏官为忌神，喜欢酒色而好斗，而且个性急躁，容易和他人发生冲突，做事过度激进，使人难于容忍与谅解而树敌，所以知心朋友不多。<br>·正印为喜用，其人宅心仁厚，精神潇洒，心性善良，富人情味，知性敏锐，处世圆融，重视人格的内涵与高尚气质的培养，且对宗教与道德规范有敬仰与谨守的勇气。<br>·偏印为喜用，具有独创性的优秀才能，有奇特的领悟力与感受力，警觉性高，擅长偏业，旁谋，并有心得，并善于察言观色，心思细腻，精明干炼。<br>·比肩为喜用，外表平凡却外虚内实，用心努力之人，善比较选择，改良创办，意志坚定不易改变立场，与朋友交往重实质的情谊。一般而言比肩是象征意志坚定，自尊心强，分别是非，择善固执，坚守岗位，忍耐心很强，常能在逆境中完成心愿。<br>·劫财为喜用，外缘好，口才很好，热忱直率豪爽，心思敏捷，善于见风转舵，临机应变，并主其人好义，顾盼自豪，有社交才华与创业雄心。";
}
?>