<?php
$zs=$wnum1+$wnum2+$wnum3+$wnum4+$wnum5+$ywnum1+$ywnum2+$ywnum3+$ywnum4+$ywnum5;
$w1=($wnum1+$ywnum1)/$zs*100;
$w2=($wnum2+$ywnum2)/$zs*100;
$w3=($wnum3+$ywnum3)/$zs*100;
$w4=($wnum4+$ywnum4)/$zs*100;
$w5=($wnum5+$ywnum5)/$zs*100;
if(tgdzwh($tg[$dtg])=="金"){
	$i=$zh;
	$zh=($w5+$w1)-($w4+$w3+$w2);
}
if(tgdzwh($tg[$dtg])=="金" and (w5+w1)>=(w4+w3+w2)){
	$ys="木火";
	$yf="<img src=yf/hs.jpg>";
	$hy="利从事与火有关的行业：厨师、饮食、饭店、宾馆、工厂、百货、美容、光学、照明、照相、眼镜、电力、电器、爆竹烟花、冶炼、易烧易燃的油类酒精类、理发、化妆品、人身装饰品，旁及工艺品、塑料、轮胎、电信、镭射、印制、评论家、军界、文艺文字、文具、作家、写作撰文、教师、文秘、出版、政界等佛教、电脑、电影、塑胶、易燃品、军火、香烟、打火机、照明、吸水、抽湿、军人等等。";
	$jxs="红色、粉色、青色、绿色";
	$lucknum = "尾数为 2.7.3.8 的数字";
	$location = "利南方、东方，利座南朝北、座东朝西（求学、事业发展方向，睡觉床位、书桌、办公桌、房子朝向等一致，会对人生有极大的帮助）";
}
if(tgdzwh($tg[$dtg])=="金" and ($w5+$w1)<($w4+$w3+$w2)){
	$ys="土金";
	$yf="<img src=yf/tj.jpg>";
	$hy="利从事与土有关的行业：房地产性质、农作性质、畜牧性质、大自然原物性质、中间人性质，又因土最卑下，最中央，故领导性质、人才事业、防水事业均属之。";
	$jxs="黄色、棕色、金色、银色、白色";
	$lucknum = "尾数为 0.5.4.9 的数字";
	$location = "利中央、本地、西方、西北方、西南方，利座西朝东（求学、事业发展方向，睡觉床位、书桌、办公桌、房子朝向等一致，会对人生有极大的帮助）";
}

if(tgdzwh($tg[$dtg])=="木"){
	$i=$zh;
	$zh=($w2+$w3)-($w1+$w4+$w5);
}
if(tgdzwh($tg[$dtg])=="木" and ($w2+$w3)>=($w1+$w4+$w5)){
	$ys="土金";
	$yf="<img src=yf/jh.jpg>";
	$hy="利从事与金有关的行业：与金属之工具或材料有关之行业，坚硬的事业，决断事业，主导别人的事业，皆属金。如：武术家，民意代表，五金业，挖掘业，发掘业，开矿业，汽车业，交通业，金融业，银行业，股票业，期货业，电器业，计算机硬件，计算机零件，科学界，珠宝业，伐木业，工具机械业，刀剑制造业等等。";
	$jxs="金色、银色、白色、黄色。";
	$lucknum = "尾数为 4.9.5.0 的数字";
	$location = "利西方、中央、本地，利座西朝东（人生求学、事业发展方向，睡觉床位、书桌、办公桌、房子朝向等一致，会对人生有极大的帮助）";
}
if(tgdzwh($tg[$dtg])=="木" and ($w2+$w3)<=($w1+$w4+$w5)){
	$ys="木水";
	$yf="<img src=yf/sm.jpg>";
	$hy="利从事与水有关的行业：带流动性，带连续性，漂流不定性，奔波性，易生变化性，液体性，音响性，清洁性，皆属水。如：航海业，船员，渔民，靠海为生者，渔业，水产业，水利业，饮用水业，水库业，水上活动业，探水业，打水业，洁净水业，清洁业，游泳池业，湖塘业，池塘 养殖业，浴池业，冷冻食品业，搬迁业，运输业等等。";
	$jxs="黑色、蓝色、绿色";
	$lucknum = "尾数为 1.6.3.8 的数字";
	$location = "利北方、东方、东北方，利座北朝南、座东朝西（求学、事业发展方向，睡觉床位、书桌、办公桌、房子朝向等一致，会对人生有极大的帮助）";
}

if (tgdzwh($tg[$dtg])=="水"){
	$i=$zh;
	$zh=($w1+$w3)-($w5+$w2+$w4);
	if (tgdzwh($tg[$dtg])=="水" and ($w1+$w3)>=($w5+$w2+$w4)){
		$ys="火土";
		$yf="<img src=yf/tm.jpg>";
		$hy="利从事与土有关的行业：房地产性质、农作性质、畜牧性质、大自然原物性质、中间人性质，又因土最卑下，最中央，故领导性质、人才事业、防水事业均属之。";
		$jxs="黄色、红色、粉色";
		$lucknum = "尾数为 0.5.2.7 的数字";
		$location = "利中央、本地、南方，利座南朝北（求学、事业发展方向，睡觉床位、书桌、办公桌、房子朝向等一致，会对人生有极大的帮助）";
	}
	if(tgdzwh($tg[$dtg])=="水" and ($w1+$w3)<=($w5+$w2+$w4)){
		$ys="金水";
		$yf="<img src=yf/js.jpg>";
		$hy="利从事与金有关的行业：与金属之工具或材料有关之行业，坚硬的事业，决断事业，主导别人的事业，皆属金。如：武术家，民意代表，五金业，挖掘业，发掘业，开矿业，汽车业，交通业，金融业，银行业，股票业，期货业，电器业，计算机硬件，计算机零件，科学界，珠宝业，伐木业，工具机械业，刀剑制造业等等。";
		$jxs="金色、银色、白色、灰色、黑色、蓝色";
		$lucknum = "尾数为 4.9.1.6 的数字";
		$location = "利西方、北方、西北方，利座北朝南、座西朝东（求学、事业发展方向，睡觉床位、书桌、办公桌、房子朝向等一致，会对人生有极大的帮助）";
	} 
}

if (tgdzwh($tg[$dtg])=="火"){
	$i=$zh;
	$zh=($w4+$w2)-($w5+$w3+$w1);
}
if(tgdzwh($tg[$dtg])=="火" and $zh==($w4+$w2)>=($w5+$w3+$w1)){
	$ys="金水";
	$yf="<img src=yf/st.jpg>";
	$hy="利从事与水有关的行业：带流动性，带连续性，漂流不定性，奔波性，易生变化性，液体性，音响性，清洁性，皆属水。如：航海业，船员，渔民，靠海为生者，渔业，水产业，水利业，饮用水业，水库业，水上活动业，探水业，打水业，洁净水业，清洁业，游泳池业，湖塘业，池塘 养殖业，浴池业，冷冻食品业，搬迁业，运输业等等。";
	$jxs="黑色、蓝色、白色、金色";
	$lucknum = "尾数为 1.6.4.9 的数字";
	$location = "利北方、西方、西北方，利座北朝南、座西朝东（求学、事业发展方向，睡觉床位、书桌、办公桌、房子朝向等一致，会对人生有极大的帮助）";
}
if (tgdzwh($tg[$dtg])=="火" and $zh==($w4+$w2)<=($w5+$w3+$w1)){
	$ys="木火";
	$yf="<img src=yf/mh.jpg>";
	$hy="利从事与木有关的行业：木材、木器、家具、园林、花木、菜园、森林、竹子、竹器等。木主直，有利从事管理行业，工商管理部门，人事管理部门。";
	$jxs="绿色、红色、紫色";
	$lucknum = "尾数为 3.8.2.7 的数字";
	$location = "利东、东南方、南方，利座南朝北、座东朝西（求学、事业发展方向，睡觉床位、书桌、办公桌、房子朝向等一致，会对人生有极大的帮助）";
}
if (tgdzwh($tg[$dtg])=="土"){
	$i=$zh;
	$zh=($w5+$w4)-($w2+$w1+$w3);
}
if (tgdzwh($tg[$dtg])=="土" and ($w5+$w4)>=($w2+$w1+$w3)){
	$ys="木水";
	$yf="<img src=yf/mj.jpg>";
	$hy="利从事与木有关的行业：木材、木器、家具、园林、花木、菜园、森林、竹子、竹器等。木主直，有利从事管理行业，工商管理部门，人事管理部门。";
	$jxs="绿色、蓝色、黑色、青色";
	$lucknum = "尾数为 3.8.1.6 的数字";
	$location = "利东、北方，利座北朝南、座东朝西（求学、事业发展方向，睡觉床位、书桌、办公桌、房子朝向等一致，会对人生有极大的帮助）";
}
if (tgdzwh($tg[$dtg])=="土" and ($w5+$w4)<=($w2+$w1+$w3)){
	$ys="火土";
	$yf="<img src=yf/ht.jpg>";
	$hy="利从事与火有关的行业：厨师、饮食、饭店、宾馆、工厂、百货、美容、光学、照明、照相、眼镜、电力、电器、爆竹烟花、冶炼、易烧易燃的油类酒精类、理发、化妆品、人身装饰品，旁及工艺品、塑料、轮胎、电信、镭射、印制、评论家、军界、文艺文字、文具、作家、写作撰文、教师、文秘、出版、政界等佛教、电脑、电影、塑胶、易燃品、军火、香烟、打火机、照明、吸水、抽湿、军人等等。";
	$jxs="红色、紫色、黄色、褐色";
	$lucknum = "尾数为 2.7.0.5 的数字";
	$location = "利南方、本地、中央，利座南朝北（求学、事业发展方向，睡觉床位、书桌、办公桌、房子朝向等一致，会对人生有极大的帮助）";
}